## Library and Data

In [2]:
import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split

In [3]:
data = pd.read_csv('data.csv')
data.head()

   AGE  CAR
0   23    0
1   34    1
2   45    0
3   56    1
4   43    1

In [4]:
data.describe()

             AGE        CAR
count  14.000000  14.000000
mean   36.000000   0.428571
std    12.691608   0.513553
min    20.000000   0.000000
25%    24.750000   0.000000
50%    33.000000   0.000000
75%    44.500000   1.000000
max    60.000000   1.000000

## Train Test Split

### Horizontal Split

In [7]:
X = data.drop(['CAR'],axis='columns')
Y = data['CAR']

In [9]:
X

    AGE
0    23
1    34
2    45
3    56
4    43
5    32
6    45
7    23
8    32
9    21
10   60
11   20
12   30
13   40

In [10]:
Y

0     0
1     1
2     0
3     1
4     1
5     0
6     0
7     0
8     1
9     0
10    0
11    1
12    1
13    0
Name: CAR, dtype: int64

### Vertical Split

In [15]:
X_train, X_test, Y_train, Y_test = train_test_split(X,Y,test_size=0.2,random_state=8)

In [16]:
X_train

    AGE
11   20
12   30
6    45
0    23
13   40
8    32
5    32
9    21
1    34
4    43
3    56